
Процедура ПриКопировании(ОбъектКопирования)

	Код = "";

КонецПроцедуры

Процедура СгенерироватьУникальныйКод() Экспорт
	
	Код = Строка(Новый УникальныйИдентификатор());	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		
		Если ЭтоНовый() Тогда 
		
			ВыгружатьПараметрыПоВерсии2_01 = Истина;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник) Тогда
			
			СообщитьОбОшибке("Не указана конфигурация - источник", Отказ);
						
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Приемник) Тогда
			
			СообщитьОбОшибке("Не указана конфигурация - приемник", Отказ);
			
		КонецЕсли;
		
		ИмяИсточника = Источник.Имя;
		ИмяПриемника = Приемник.Имя;
		
	КонецЕсли;
	
	Если ПустаяСтрока(Наименование) Тогда
		
		Наименование = глНаименованиеКонвертации(ЭтотОбъект);
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПустаяСтрока(Наименование) Тогда
		
		Наименование = глНаименованиеКонвертации(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры
