///////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 

// Выполняет проверку существования объекта метаданных в базе данных.
//
// Параметры:
//  ТестоваяСсылка - Произвольный - ссылка, существование объекта которой необходимо проверить.
//
// Возвращаемое значение:
//	Флаг наличия объекта в базе данных.
//
Функция ОбъектБазыДанныхСуществует(ТестоваяСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТестоваяСсылка)
		ИЛИ ТипЗнч(ТестоваяСсылка) = Тип("Строка")
		ИЛИ ТипЗнч(ТестоваяСсылка) = Тип("Число")
		ИЛИ ТипЗнч(ТестоваяСсылка) = Тип("Дата")
		ИЛИ ТипЗнч(ТестоваяСсылка) = Тип("Булево") Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	ОбъектМетаданные = ТестоваяСсылка.Метаданные();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Cсылка", ТестоваяСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИСТИНА КАК СсылкаБДСуществует
	|ИЗ
	|	" + ОбъектМетаданные.ПолноеИмя() + " КАК " + ОбъектМетаданные.Имя + "
	|ГДЕ
	|	" + ОбъектМетаданные.Имя + ".Ссылка = &Cсылка";
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции // ОбъектБДСуществует()
