
Процедура СгенерироватьУникальныйКод() Экспорт
		
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	// Проверка корректности имени правила (кода)
	Если Не глИмяКорректно(Код) Тогда
		СообщитьОбОшибке("Не правильно указано имя обработки!", Отказ);
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(Наименование) Тогда
		Наименование = СокрЛП(Код);
	КонецЕсли; 
	
	Для каждого СтрокаТЧ Из Параметры Цикл
		СтрокаТЧ.ИмяПараметра = СокрЛП(СтрокаТЧ.Параметр);
	КонецЦикла;
		
КонецПроцедуры

