
Процедура СгенерироватьУникальныйКод() Экспорт
	
	УстановитьНовыйКод();	
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ЭтоГруппа Тогда
		
		ЗначениеИсточник = Строка(Источник);
		ЗначениеПриемник = Строка(Приемник);
		
	КонецЕсли;

    Если ПустаяСтрока(Наименование) Тогда
		Наименование = глНаименованиеПКЗ(ЭтотОбъект);
	КонецЕсли; 

	Если Порядок = 0 Тогда
		Порядок = ОчереднойПорядок("ПравилаКонвертацииЗначений", Родитель, Владелец);
	КонецЕсли;
    	
КонецПроцедуры // ПередЗаписью()
