
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЭтоГруппа Тогда
		
		// проверим правильность заполнения шапки элемента
		Заголовок = ПредставлениеОбъектаПриЗаписи(ЭтотОбъект);
		
		// структура реквизитов для проверки заполнения
		СтруктураОбязательныхПолей = Новый Структура("Конфигурация, ПланОбмена");
		
		// вызываем общую процедуру проверки заполнения шапки элемента
		ПроверитьЗаполнениеРеквизитовШапкиОбъекта(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		// если наименование не заполнено, то получаем значение по умолчанию
		Если ПустаяСтрока(Наименование) Тогда
			
			Наименование = глНаименованиеРегистрации(ЭтотОбъект);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
