////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	НомерОтправленного = УзелОбмена.НомерОтправленного;
	НомерПринятого = УзелОбмена.НомерПринятого;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Если УзелОбмена.НомерОтправленного = НомерОтправленного
		И УзелОбмена.НомерПринятого = НомерПринятого Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбъектУзла = УзелОбмена.ПолучитьОбъект();
	
	Попытка
	
		ОбъектУзла.НомерОтправленного = НомерОтправленного;
		ОбъектУзла.НомерПринятого = НомерПринятого;
		
		ОбъектУзла.Записать();
		
	Исключение
		
		Сообщить("Возникла ошибка при изменении номеров сообщений обмена: " + ОписаниеОшибки());
		
	Конецпопытки;
	
КонецПроцедуры

