
Функция ПолучитьЗначениеНастройки(ИмяНастройки, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Результат = Неопределено;
	ПрочитанноеЗначение = ХранилищеОбщихНастроек.Загрузить(ИмяНастройки);
	
	Если ИмяНастройки = "bnОкруглениеДатыВыгрузки" Тогда
		
		Если ТипЗнч(ПрочитанноеЗначение) = Тип("Число") Тогда
			Результат = ПрочитанноеЗначение;
		Иначе
			Результат = 0;
		КонецЕсли;
		
	ИначеЕсли ПрочитанноеЗначение = Неопределено Тогда
		
		Результат = ЗначениеПоУмолчанию;
		
	Иначе
		
		Результат = ПрочитанноеЗначение;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
