Перем глТекущийПользователь Экспорт;

Процедура ПриНачалеРаботыСистемы()
	
	ОпределитьТекущегоПользователя();
	
КонецПроцедуры

Процедура ОпределитьТекущегоПользователя()

	// если пользователь уже найден, то ничего не делаем больше
	Попытка
		
		Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь) Тогда
			Возврат;
		КонецЕсли;
		
	Исключение
		
    КонецПопытки;
	
	Если ПустаяСтрока(ИмяПользователя()) Тогда
		ИмяПользователя           = "ВнешнееСоединение";
		ПолноеИмяПользователя     = "Внешнее соединение";

	Иначе
		ИмяПользователя           = ИмяПользователя();

		Если ПустаяСтрока(ПолноеИмяПользователя()) Тогда
			ПолноеИмяПользователя = ИмяПользователя;
		Иначе
			ПолноеИмяПользователя = ПолноеИмяПользователя();
		КонецЕсли;
	КонецЕсли;

	глТекущийПользователь = Справочники.Пользователи.НайтиПоКоду(ИмяПользователя);

	Если глТекущийПользователь = Справочники.Пользователи.ПустаяСсылка() Тогда
		ОбъектПользователь = Справочники.Пользователи.СоздатьЭлемент();

		ОбъектПользователь.Код          = ИмяПользователя;
		ОбъектПользователь.Наименование = ПолноеИмяПользователя;

		ОбъектПользователь.Записать();
        глТекущийПользователь = ОбъектПользователь.Ссылка;
		
	КонецЕсли;
	
	ПараметрыСеанса.ТекущийПользователь = глТекущийПользователь;

КонецПроцедуры // ОпределитьТекущегоПользователя()
