

Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Закрыть(Истина);
	
КонецПроцедуры

Процедура ОсновныеДействияФормыОтмена(Кнопка)
	
	Закрыть();
	
КонецПроцедуры

// выбрать объекты для регистрации из запроса
Процедура ВыбратьИзЗапросаНажатие(Элемент)
	
	// открываем форму выбора данных из запроса
	ФормаЗапроса = ПолучитьФорму("ФормаРезультатаЗапроса");
	
	РезультатОткрытияМодально = ФормаЗапроса.ОткрытьМодально();
	
	Если НЕ (РезультатОткрытияМодально = Истина) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ФормаЗапроса.РезультатТаблица Цикл
		
		СписокРедактирования.Добавить(СтрокаТаблицы.Ссылка, Строка(СтрокаТаблицы.Ссылка));
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ТипОбъектовДляВыгрузкиПриИзменении(Элемент)
	
	Если ТипОбъектовДляВыгрузки <> Неопределено Тогда 
		ЭлементыФормы.СписокРедактирования.ТипЗначенияСписка = ТипОбъектовДляВыгрузки;
	КонецЕсли;
	
КонецПроцедуры
