
//TODO: <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
//
Процедура УстановитьСостояниеКнопокПанелиРедактора(ЭлементыФормы, Событие, ФайлыРавны = Истина) Экспорт
	
	КоманднаяПанельРедактора = ЭлементыФормы.КоманднаяПанельРедактированиеОбработчиков;
	КнопкиПарениРедактора = КоманднаяПанельРедактора.Кнопки;
	
	Если Событие = "ПриОткрытии" ИЛИ Событие = "Записать" ИЛИ Событие = "ОтменитьИзменения" Тогда
		
		КнопкиПарениРедактора.Изменить.Доступность = Истина;
		КнопкиПарениРедактора.Записать.Доступность = Ложь;
		КнопкиПарениРедактора.ОтменитьИзменения.Доступность = Ложь;
		КнопкиПарениРедактора.ПоказатьИзменения.Доступность = Ложь;
		
	ИначеЕсли Событие = "Изменить" Тогда
		
		КнопкиПарениРедактора.Изменить.Доступность = Ложь;
		КнопкиПарениРедактора.Записать.Доступность = Ложь;
		КнопкиПарениРедактора.ОтменитьИзменения.Доступность = Истина;
		КнопкиПарениРедактора.ПоказатьИзменения.Доступность = Ложь;
		
	ИначеЕсли Событие = "СравнитьФайлы" Тогда
		
		КнопкиПарениРедактора.Записать.Доступность = НЕ ФайлыРавны;
		КнопкиПарениРедактора.ПоказатьИзменения.Доступность = НЕ ФайлыРавны;
		
	КонецЕсли;
	
КонецПроцедуры

//TODO: <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
//
Процедура КомандаРедактораИзменить(ЭлементыФормы, МассивОбработчиков, ТекстОбработчикаДоИзменений, ПутьКФайлуДоИзменений, ПутьКФайлуТекущий) Экспорт
	
	//доступность закладок
	ПанельАлгоритмы = ЭлементыФормы.ПанельАлгоритмы;
	ИмяТекущегоОбработчика = ПанельАлгоритмы.ТекущаяСтраница.Имя;
	
	Для Каждого ИмяОбработчика Из МассивОбработчиков Цикл
		ПанельАлгоритмы.Страницы[ИмяОбработчика].Доступность = (ИмяТекущегоОбработчика = ИмяОбработчика);
	КонецЦикла;
	
	//доступность поля обработчика
	ЭлементыФормы[ИмяТекущегоОбработчика].Доступность = Ложь;
	
	//доступность кнопок панели
	УстановитьСостояниеКнопокПанелиРедактора(ЭлементыФормы, "Изменить");
	
	//работа с файлами
	Путь = КаталогВременныхФайлов();
	ПутьКФайлуДоИзменений = Путь + "BeforChange.bsl";
	ПутьКФайлуТекущий = Путь + "NewEdit.bsl";
	
	ТекстОбработчикаДоИзменений = ЭлементыФормы[ИмяТекущегоОбработчика].ПолучитьТекст();
	
	ФайлОбработчикаДоИзменений = Новый ТекстовыйДокумент;
	ФайлОбработчикаДоИзменений.УстановитьТекст(ТекстОбработчикаДоИзменений);
	ФайлОбработчикаДоИзменений.Записать(ПутьКФайлуДоИзменений);
	
	ФайлОбработчикаТекущий = Новый ТекстовыйДокумент;
	ФайлОбработчикаТекущий.УстановитьТекст(ТекстОбработчикаДоИзменений);
	ФайлОбработчикаТекущий.Записать(ПутьКФайлуТекущий);
	
КонецПроцедуры

//TODO: <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
//
Процедура КомандаРедактораЗаписать(ЭлементыФормы, МассивОбработчиков, ПутьКФайлуТекущий) Экспорт
	
	//доступность закладок
	ПанельАлгоритмы = ЭлементыФормы.ПанельАлгоритмы;
	ИмяТекущегоОбработчика = ПанельАлгоритмы.ТекущаяСтраница.Имя;
	
	Для Каждого ИмяОбработчика Из МассивОбработчиков Цикл
		ПанельАлгоритмы.Страницы[ИмяОбработчика].Доступность = Истина;
	КонецЦикла;
	
	//доступность поля обработчика
	ЭлементыФормы[ИмяТекущегоОбработчика].Доступность = Истина;
	
	//доступность кнопок панели
	УстановитьСостояниеКнопокПанелиРедактора(ЭлементыФормы, "Записать");
	
	//работа с файлами
	ФайлОбработчикаТекущий = Новый ТекстовыйДокумент;
	ФайлОбработчикаТекущий.Прочитать(ПутьКФайлуТекущий);
	
	ЭлементыФормы[ИмяТекущегоОбработчика].УстановитьТекст(ФайлОбработчикаТекущий.ПолучитьТекст());
	
КонецПроцедуры

//TODO: <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
//
Процедура КомандаРедактораОтменитьИзменения(ЭлементыФормы, МассивОбработчиков, ТекстОбработчикаДоИзменений) Экспорт
	
	//доступность закладок
	ПанельАлгоритмы = ЭлементыФормы.ПанельАлгоритмы;
	ИмяТекущегоОбработчика = ПанельАлгоритмы.ТекущаяСтраница.Имя;
	
	Для Каждого ИмяОбработчика Из МассивОбработчиков Цикл
		ПанельАлгоритмы.Страницы[ИмяОбработчика].Доступность = Истина;
	КонецЦикла;
	
	//доступность поля обработчика
	ЭлементыФормы[ИмяТекущегоОбработчика].Доступность = Истина;
	
	//доступность кнопок панели
	УстановитьСостояниеКнопокПанелиРедактора(ЭлементыФормы, "ОтменитьИзменения");
	
	//работа с файлами
	ЭлементыФормы[ИмяТекущегоОбработчика].УстановитьТекст(ТекстОбработчикаДоИзменений);
	
КонецПроцедуры

//TODO: <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
//
Процедура КомандаРедактораПоказатьРазличия(ПутьКФайлуДоИзменений, ПутьКФайлуТекущий) Экспорт
	
	СравнениеФайлов = Новый СравнениеФайлов;
	
	СравнениеФайлов.ПервыйФайл						= ПутьКФайлуДоИзменений;
	СравнениеФайлов.ВторойФайл						= ПутьКФайлуТекущий;
	СравнениеФайлов.СпособСравнения					= СпособСравненияФайлов.ТекстовыйДокумент;
	СравнениеФайлов.УчитыватьРегистр				= Истина;
	СравнениеФайлов.ИгнорироватьПустоеПространство	= Истина;
	СравнениеФайлов.ПоказатьРазличия();
	
КонецПроцедуры

//TODO: <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
//
Процедура ОбработчикОжиданияПроверитьРазличия(ЭлементыФормы, ПутьКФайлуДоИзменений, ПутьКФайлуТекущий) Экспорт
	
	СравнениеФайлов = Новый СравнениеФайлов;
	
	СравнениеФайлов.ПервыйФайл						= ПутьКФайлуДоИзменений;
	СравнениеФайлов.ВторойФайл						= ПутьКФайлуТекущий;
	СравнениеФайлов.СпособСравнения					= СпособСравненияФайлов.ТекстовыйДокумент;
	СравнениеФайлов.УчитыватьРегистр				= Истина;
	СравнениеФайлов.ИгнорироватьПустоеПространство	= Истина;
	ФайлыРавны = СравнениеФайлов.Сравнить();
	
	УстановитьСостояниеКнопокПанелиРедактора(ЭлементыФормы, "СравнитьФайлы", ФайлыРавны);
	
КонецПроцедуры
