
//TODO: <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
//
Процедура УстановитьСостояниеКнопокПанелиРедактора(ЭлементыФормы, Событие) Экспорт
	
	КоманднаяПанельРедактора = ЭлементыФормы.КоманднаяПанельРедактированиеОбработчиков;
	КнопкиПарениРедактора = КоманднаяПанельРедактора.Кнопки;
	
	Если Событие = "ПриОткрытии" Тогда
		
		КнопкиПарениРедактора.Изменить.Доступность = Истина;
		КнопкиПарениРедактора.Записать.Доступность = Ложь;
		КнопкиПарениРедактора.ОтменитьИзменения.Доступность = Ложь;
		КнопкиПарениРедактора.ПоказатьИзменения.Доступность = Ложь;
		
	ИначеЕсли Событие = "Изменить" Тогда
		
		КнопкиПарениРедактора.Изменить.Доступность = Ложь;
		КнопкиПарениРедактора.Записать.Доступность = Истина;
		КнопкиПарениРедактора.ОтменитьИзменения.Доступность = Истина;
		КнопкиПарениРедактора.ПоказатьИзменения.Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

