
Процедура ПриОткрытии()
	
	Выбор = Ложь;
	ТаблицаОМД.Колонки.Добавить("Значение");
	
	ДобавитьОМД(Метаданные.Справочники, 0);
	ДобавитьОМД(Метаданные.Документы, 1);
	ДобавитьОМД(Метаданные.ПланыОбмена, 2);
	ДобавитьОМД(Метаданные.ПланыВидовХарактеристик, 3);
	ДобавитьОМД(Метаданные.ПланыСчетов, 4);
	ДобавитьОМД(Метаданные.ПланыВидовРасчета, 5);
	ДобавитьОМД(Метаданные.РегистрыРасчета, 6);
	ДобавитьОМД(Метаданные.РегистрыСведений, 7);
	ДобавитьОМД(Метаданные.РегистрыНакопления, 8);
	ДобавитьОМД(Метаданные.РегистрыБухгалтерии, 9);
	ДобавитьОМД(Метаданные.БизнесПроцессы, 10);
	ДобавитьОМД(Метаданные.Задачи, 11);
	
КонецПроцедуры

Процедура ДобавитьОМД(ОбъектыМетаданных, ТипКартинки) 
	
	Для Каждого ОМД Из ОбъектыМетаданных Цикл
		
		Если ОМД.ПолнотекстовыйПоиск = Метаданные.СвойстваОбъектов.ИспользованиеПолнотекстовогоПоиска.Использовать Тогда
			НоваяСтрока = ТаблицаОМД.Добавить();
			НоваяСтрока.Значение = ОМД;
			Если СписокОМД.НайтиПоЗначению(ОМД) = Неопределено Тогда
				НоваяСтрока.Отбор = Ложь;
			Иначе
				НоваяСтрока.Отбор = Истина;
			КонецЕсли;	
			НоваяСтрока.НазваниеОМД = Строка(ОМД);
			НоваяСтрока.ТипКартинки = ТипКартинки;
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОсновныеДействияФормыДействие(Кнопка)
	ОК = Истина;
	Закрыть();
КонецПроцедуры

Процедура ОсновныеДействияФормыКнопкаЗакрыть(Кнопка)
	ОК = Ложь;
	Закрыть();
КонецПроцедуры

Процедура ТаблицаОМДПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	ОформлениеСтроки.Ячейки.КолонкаКартинки.ИндексКартинки = ДанныеСтроки.ТипКартинки;
	ОформлениеСтроки.Ячейки.КолонкаКартинки.ОтображатьКартинку = Истина;
КонецПроцедуры
