
Процедура ПередЗаписью(Отказ)

	// Проверка корректности имени
	Если Не глИмяКорректно(Код) Тогда
		СообщитьОбОшибке("Не правильно указано имя параметра!", Отказ);
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(Наименование) Тогда
		Наименование = СокрЛП(Код);
	КонецЕсли; 
	
	Если ПередаватьПараметрПриВыгрузке Тогда
		
		УстанавливатьВДиалоге = Истина;
		ИспользуетсяПриЗагрузке = Истина;
		
	КонецЕсли;

КонецПроцедуры

Процедура СгенерироватьУникальныйКод() Экспорт
	
	
КонецПроцедуры

