
#Если Клиент Тогда

Процедура ВыполнитьСинхронизацию() Экспорт
	
	// очищаем дерево
	Правила.Колонки.Очистить();
	
	Правила.Колонки.Добавить("Правило");
	Правила.Колонки.Добавить("Действие");
	Правила.Колонки.Добавить("Комментарий");
	
	ИерархияСтрок = Новый Соответствие;
	
	// Выполняем синхронизацию ПКС
	
	ИерархияСтрок.Вставить(Справочники.ПравилаКонвертацииСвойств.ПустаяСсылка(), Правила);
	
    ПравилоКорректно = Истина;
	
	НовыйИсточникПустой = НовыйИсточник.Пустая();
	НовыйПриемникПустой = НовыйПриемник.Пустая();	
	
	ПКСВыборка = Справочники.ПравилаКонвертацииСвойств.ВыбратьИерархически(, ПКО,,);
	Пока ПКСВыборка.Следующий() Цикл
		
		Если (НЕ ПКСВыборка.ЭтоГруппа) 
			И (ПКСВыборка.Приемник.Пустая() ИЛИ ПКСВыборка.ПометкаУдаления) Тогда
			
			Продолжить;
			
		КонецЕсли;

		НоваяСтрока = ИерархияСтрок[ПКСВыборка.Родитель].Строки.Добавить();
        НоваяСтрока.Правило = ПКСВыборка.Ссылка;
				
		ПКСОбъект = ПКСВыборка.ПолучитьОбъект();
		ПКСИзменен = Ложь;
		
		Если (НЕ НовыйИсточникПустой) Тогда
			
			НайденноеСвойствоИсточникРодитель = ПолучитьРодителяСвойства(ПКСОбъект.Источник.Родитель.Наименование, НовыйИсточник);
			
			НайденноеСвойствоИсточник = Справочники.Свойства.НайтиПоНаименованию(ПКСОбъект.Источник.Наименование, Истина, НайденноеСвойствоИсточникРодитель, НовыйИсточник);
			
			Если НайденноеСвойствоИсточник <> ПКСОбъект.Источник Тогда
			
				Если НайденноеСвойствоИсточник.Пустая() Тогда
		            НоваяСтрока.Действие    = "Источник очищен. ";
					НоваяСтрока.Комментарий = "Объект не содержит реквизита: " + СокрЛП(ПКСОбъект.Источник.Наименование) + ". ";
				Иначе
		            НоваяСтрока.Действие    = "Установлен новый источник. ";
					НоваяСтрока.Комментарий = "Установлен новый реквизит: " + СокрЛП(НайденноеСвойствоИсточник.Наименование) + ". ";
				КонецЕсли;
				
				Если Не ОчищатьПустыеСвойства И НайденноеСвойствоИсточник.Пустая() Тогда
				Иначе
					
					ПКСОбъект.Источник = НайденноеСвойствоИсточник;
					ПКСИзменен = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли НовыйИсточникПустой Тогда
			
			Если ЗначениеЗаполнено(ПКСОбъект.Источник) Тогда
				
				НоваяСтрока.Действие    = "Источник очищен. ";
				НоваяСтрока.Комментарий = "Объект не содержит реквизита: " + СокрЛП(ПКСОбъект.Источник.Наименование) + ". ";
				ПКСОбъект.Источник = Справочники.Свойства.ПустаяСсылка();
				ПКСИзменен = Истина;

			КонецЕсли;
			
		КонецЕсли;

		Если (НЕ НовыйПриемникПустой) Тогда
			
			НайденноеСвойствоПриемникРодитель = ПолучитьРодителяСвойства(ПКСОбъект.Приемник.Родитель.Наименование, НовыйПриемник);
			
			НайденноеСвойствоПриемник = Справочники.Свойства.НайтиПоНаименованию(ПКСОбъект.Приемник.Наименование, Истина, НайденноеСвойствоПриемникРодитель, НовыйПриемник);
			
			Если НайденноеСвойствоПриемник <> ПКСОбъект.Приемник Тогда
			
				Если НайденноеСвойствоПриемник.Пустая() Тогда
		            НоваяСтрока.Действие    = ?(НоваяСтрока.Действие = Неопределено, "", НоваяСтрока.Действие) + "Приемник очищен. Правило помечено на удаление.";
					НоваяСтрока.Комментарий = ?(НоваяСтрока.Комментарий = Неопределено, "", НоваяСтрока.Комментарий) + "Объект не содержит реквизита: " + СокрЛП(ПКСОбъект.Приемник.Наименование) + ". Правило не корректно!";
					ПравилоКорректно = Ложь;
				Иначе
		            НоваяСтрока.Действие    = ?(НоваяСтрока.Действие = Неопределено, "", НоваяСтрока.Действие) + "Установлен новый приемник.";
					НоваяСтрока.Комментарий = ?(НоваяСтрока.Комментарий = Неопределено, "", НоваяСтрока.Комментарий) + "Установлен новый реквизит: " + СокрЛП(НайденноеСвойствоПриемник.Наименование) + ".";
					ПравилоКорректно = Истина;
				КонецЕсли;
				
				Если Не ОчищатьПустыеСвойства И НайденноеСвойствоПриемник.Пустая() Тогда
				Иначе
					
					ПКСОбъект.Приемник = НайденноеСвойствоПриемник;
					ПКСИзменен = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли НовыйПриемникПустой Тогда
			
			Если ЗначениеЗаполнено(ПКСОбъект.Приемник) Тогда
				
				НоваяСтрока.Действие    = ?(НоваяСтрока.Действие = Неопределено, "", НоваяСтрока.Действие) + "Приемник очищен. Правило помечено на удаление.";
				НоваяСтрока.Комментарий = ?(НоваяСтрока.Комментарий = Неопределено, "", НоваяСтрока.Комментарий) + "Объект не содержит реквизита: " + СокрЛП(ПКСОбъект.Приемник.Наименование) + ". Правило не корректно!";
				ПКСОбъект.Приемник = Справочники.Свойства.ПустаяСсылка();
				ПравилоКорректно = Ложь;
				ПКСИзменен = Истина;

			КонецЕсли;	
			
		КонецЕсли;

		Если ПКСВыборка.ЭтоГруппа Тогда
			
			Если ПустаяСтрока(НоваяСтрока.Комментарий) Тогда 
				НоваяСтрока.Комментарий = "Не изменен";
			КонецЕсли;
			
			ИерархияСтрок.Вставить(ПКСВыборка.Ссылка, НоваяСтрока);
			
		КонецЕсли;

		Если ПКСИзменен Тогда	
			
			Если НЕ ПравилоКорректно Тогда
				ПКСОбъект.ПометкаУдаления = Истина;
			КонецЕсли;
			
			ПКСОбъект.Записать();
						
		КонецЕсли;
		
	КонецЦикла;
	
	// Выполняем синхронизацию ПКЗ
	// считаем что ПКЗ не содержат групп
	
	ИерархияСтрок.Вставить(1, Правила);

	ПравилоКорректно = Истина;

	ПКЗВыборка = Справочники.ПравилаКонвертацииЗначений.Выбрать(, ПКО);
	Пока ПКЗВыборка.Следующий() Цикл
		
		Если ПКЗВыборка.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПКЗВыборка.Приемник.Пустая() ИЛИ ПКЗВыборка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ИерархияСтрок[1].Строки.Добавить();

		НоваяСтрока.Правило = ПКЗВыборка.Ссылка;
				
		ПКЗОбъект = ПКЗВыборка.ПолучитьОбъект();
		
		ПКЗИзменен = Ложь;
		
		Если НЕ НовыйИсточникПустой Тогда
			
			НайденноеЗначениеИсточник = Справочники.Значения.НайтиПоНаименованию(ПКЗОбъект.Источник.Наименование, Истина,, НовыйИсточник);
			
			Если НайденноеЗначениеИсточник <> ПКЗОбъект.Источник Тогда
			
				Если НайденноеЗначениеИсточник.Пустая() Тогда
		            НоваяСтрока.Действие    = "Источник очищен. ";
					НоваяСтрока.Комментарий = "Объект не содержит реквизита: " + СокрЛП(ПКЗОбъект.Источник.Наименование) + ". ";					
				Иначе
		            НоваяСтрока.Действие    = "Установлен новый источник. ";
					НоваяСтрока.Комментарий = "Установлен новый реквизит: " + СокрЛП(НайденноеЗначениеИсточник.Наименование) + ". ";					
				КонецЕсли;
				
				Если Не ОчищатьПустыеСвойства И НайденноеЗначениеИсточник.Пустая() Тогда
				Иначе
					
					ПКЗОбъект.Источник = НайденноеЗначениеИсточник;
					ПКЗИзменен = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если НЕ ПКЗОбъект.Источник.Пустая() Тогда
				
				НоваяСтрока.Действие    = "Источник очищен. ";
				НоваяСтрока.Комментарий = "Объект не содержит реквизита: " + СокрЛП(ПКЗОбъект.Источник.Наименование) + ". ";	
				НоваяСтрока.Источник = Справочники.Значения.ПустаяСсылка();
				ПКЗИзменен = Истина;
				
			КонецЕсли;
			
		КонецЕсли;

		Если НЕ НовыйПриемникПустой Тогда
			
			НайденноеЗначениеПриемник = Справочники.Значения.НайтиПоНаименованию(ПКЗОбъект.Приемник.Наименование, Истина,, НовыйПриемник);
			
			Если НайденноеЗначениеПриемник <> ПКЗОбъект.Приемник Тогда
			
				Если НайденноеЗначениеПриемник.Пустая() Тогда
		            НоваяСтрока.Действие    = ?(НоваяСтрока.Действие = Неопределено, "", НоваяСтрока.Действие) + "Приемник очищен. Правило помечено на удаление.";
					НоваяСтрока.Комментарий = ?(НоваяСтрока.Комментарий = Неопределено, "", НоваяСтрока.Комментарий) + "Объект не содержит реквизита: " + СокрЛП(ПКЗОбъект.Приемник.Наименование) + ". Правило не корректно!";
					ПравилоКорректно = Ложь;
				Иначе
		            НоваяСтрока.Действие    = ?(НоваяСтрока.Действие = Неопределено, "", НоваяСтрока.Действие) + "Установлен новый приемник.";
					НоваяСтрока.Комментарий = ?(НоваяСтрока.Комментарий = Неопределено, "", НоваяСтрока.Комментарий) + "Установлен новый реквизит: " + СокрЛП(НайденноеЗначениеПриемник.Наименование) + ".";
					ПравилоКорректно = Истина;
				КонецЕсли;
				
				Если Не ОчищатьПустыеСвойства И НайденноеЗначениеПриемник.Пустая() Тогда
				Иначе
					
					ПКЗОбъект.Приемник = НайденноеЗначениеПриемник;
					ПКЗИзменен = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если НЕ ПКЗОбъект.Приемник.Пустая() Тогда
				
				НоваяСтрока.Действие    = ?(НоваяСтрока.Действие = Неопределено, "", НоваяСтрока.Действие) + "Приемник очищен. Правило помечено на удаление.";
				НоваяСтрока.Комментарий = ?(НоваяСтрока.Комментарий = Неопределено, "", НоваяСтрока.Комментарий) + "Объект не содержит реквизита: " + СокрЛП(ПКЗОбъект.Приемник.Наименование) + ". Правило не корректно!";
				ПравилоКорректно = Ложь;
				ПКЗОбъект.Приемник = Справочники.Значения.ПустаяСсылка();
				ПКЗИзменен = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПКЗИзменен Тогда

			ПКЗОбъект.Записать();

			Если НЕ ПравилоКорректно Тогда
				ПКЗОбъект.УстановитьПометкуУдаления(Истина);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьРодителяСвойства(Наименование, Владелец)
	
	Результат = Справочники.Свойства.ПустаяСсылка();
	
	Если ПустаяСтрока(Наименование) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|    СправочникСвойства.Ссылка
	|ИЗ Справочник.Свойства КАК СправочникСвойства
	|ГДЕ 
	|    СправочникСвойства.Владелец       = &Владелец
	|    И СправочникСвойства.Наименование = &Наименование
	|    И СправочникСвойства.ЭтоГруппа
	|";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Владелец",     Владелец);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
