
Процедура ПриОткрытии()
	
	Если ПустаяСтрока(ИмяФайлаВыгрузки) Тогда
		
		ИмяФайлаВыгрузки = ВосстановитьЗначение("ОбработкаВыгрузкиМетаданные.ИмяФайлаВыгрузки");
						
	КонецЕсли;
	
	ОбработатьДоступностьФлагаВыгрузкиПроведения();
	
	СостояниеИндикатораПрогресса = ЭлементыФормы.НадписьСостоянияПрогрессора;
	Индикатор = ЭлементыФормы.Индикатор;
	
	ЭтаФорма.Заголовок = "Выгрузка описания структуры метаданных ("+ВерсияОбъекта()+")";
	
КонецПроцедуры // ПриОткрытии()

Процедура ИмяФайлаВыгрузкиНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ДиалогВыбораФайла								=	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогВыбораФайла.Фильтр						=	"Файл данных (*.xml)|*.xml";
	ДиалогВыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогВыбораФайла.Расширение					=	"xml";
	ДиалогВыбораФайла.ИндексФильтра					=	0;
	ДиалогВыбораФайла.ПолноеИмяФайла				=	Элемент.Значение;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	=	Ложь;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		Элемент.Значение = ДиалогВыбораФайла.ПолноеИмяФайла;
		
	КонецЕсли;

КонецПроцедуры // ИмяФайлаВыгрузкиНачалоВыбора()

Процедура КнопкаВыполнитьНажатие(Элемент)
	
	Если ПустаяСтрока(ИмяФайлаВыгрузки) Тогда
		Предупреждение("Не указано имя файла для выгрузки данных");
		Возврат;
	КонецЕсли;
	
	Если ВыполнитьВыгрузку() = Ложь Тогда
		
		Предупреждение("Ошибка создания файла!
		|Указано пустое или неверное имя файла.");
		
	Иначе
		
		Вопрос("Выгрузка описания структуры конфигурации успешно завершена.",  РежимДиалогаВопрос.ОК, 10);
		
	КонецЕсли;
	
КонецПроцедуры // КнопкаВыполнитьНажатие()

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СохранитьЗначение("ОбработкаВыгрузкиМетаданные.ИмяФайлаВыгрузки", ИмяФайлаВыгрузки);
	
КонецПроцедуры

Процедура ОбработатьДоступностьФлагаВыгрузкиПроведения()
	
	ЭлементыФормы.ВыгружатьДвиженияТолькоУДокументовСЗапретомПроведения.Доступность = НеВыгружатьДвиженияДокументов;
	
КонецПроцедуры

Процедура НеВыгружатьДвиженияДокументовПриИзменении(Элемент)
	
	ОбработатьДоступностьФлагаВыгрузкиПроведения();
	
КонецПроцедуры

НеВыгружатьДвиженияДокументов = Истина;
НеВыгружатьРегистрыСведений = Ложь;
НеВыгружатьРегистрыНакопления = Истина;
НеВыгружатьРегистрыБухгалтерии = Истина;
НеВыгружатьРегистрыРасчета = Истина;

ВыгружатьДвиженияТолькоУДокументовСЗапретомПроведения = Ложь;
