////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если ОписаниеТиповРедактированияСписка <> Неопределено Тогда 
		ЭлементыФормы.СписокРедактирования.ТипЗначенияСписка = ОписаниеТиповРедактированияСписка;
	КонецЕсли;
	
	ОписаниеТиповРедактированияСписка = Неопределено;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

Процедура ВыбратьИзЗапросаНажатие(Элемент)
	// выбрать объекты для регистрации из запроса
	
	// открываем форму выбора данных из запроса
	ФормаЗапроса = ПолучитьФорму("ФормаРезультатаЗапроса");
	
	РезультатОткрытияМодально = ФормаЗапроса.ОткрытьМодально();
	
	Если НЕ (РезультатОткрытияМодально = Истина) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ФормаЗапроса.РезультатТаблица Цикл
		
		СписокРедактирования.Добавить(СтрокаТаблицы.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Закрыть(Истина);
	
КонецПроцедуры

Процедура ОсновныеДействияФормыОтмена(Кнопка)
	
	Закрыть();
	
КонецПроцедуры

